import { FC } from 'react';

import LoggedLayout from '@/shared/layouts/logged';

import style from './style.module.scss';
import AboutUsHeader from './component/header';

const PRIVACY_TEXT = [
    {
        title: 'Публічний договір (оферта)',
        paragraphs: [
            'Публічний договір (оферта) на використання послуг додатку та вебсайту',
        ],
    },
    {
        title: 'Терміни',
        paragraphs: [
            'Договір — публічний договір на використання послуг Додатку та Сайту.',
            'Сайт — вебсайт з доменним ім’ям eats.in (http://eats.in/).ua (http://eats.in/).',
            'Продавець — ФОП ЛАВКАЙ НІНА МИКОЛАЇВНА 3145112766.',
            'Покупець — дієздатна фізична особа, відвідувач Сайту, що обрала щонайменше один товар та здійснила його замовлення.',
        ],
    },
    {
        title: '1. Загальні положення',
        paragraphs: [
            '1.1. Цей документ визначає істотні умови купівлі-продажу та є формальною пропозицією укладення публічного договору.',
            '1.2. Починаючи використовувати сайт та здійснюючи вибір та замовлення Товару ви (Покупець) погоджуєтесь з усіма умовами Договору без повних або часткових вилучень. Це право є персональним та не може бути передано іншим фізичним або юридичним особам.',
            '1.3. Продавець може змінювати умови Договору в будь-який час без обмежень змінювати Договір та зазначати дату редакції. Нова редакція набирає чинності з дати публікації, якщо інше не буде зазначено в Договорі.',
            '1.4. Оскільки зміни можуть бути внесені між відвідуваннями сайту, Покупець зобов’язується самостійно перевіряти умови Договору перед здійсненням замовлення.',
            '1.5. Відвідувачі Сайту та Покупці користуються Сайтом виключно під власну відповідальність. Сайт може бути частково або повністю недоступним у разі проведення технічних робіт або з інших причини без попереднього попередження.',
            '1.6. Продавець має право на відступлення (або інший спосіб передачі своїх прав та обов’язків) третім особам.',
            '1.7. У разі проведення акцій або інших заходів з просування товарів Продавець має право на встановлення спеціальних положень Договору. Такі умови будуть вважатись невіддільною частиною Договору та застосовуватись до усіх осіб, що будуть брати участь в акції, а замовлення акційного товару або здійснення інших акційних умов означатиме згоду осіб з такими умовами.',
        ],
    },
    {
        title: '2. Товар',
        paragraphs: [
            '2.1. На Сайті зазначається основна інформація про товар та фотографії.',
            '2.2. Фотографії є ілюстраціями до товару та можуть відрізнятися від фактичного зовнішнього вигляду товару.',
            '2.3. Інформація про товар (опис) на Сайті може містити помилки, Продавець надає актуальну інформацію за запитом Покупця. Якщо така помилка суттєво впливає на замовлення Покупця, він може внести зміни до замовлення або скасувати його, повідомивши про це Продавця після перевірки замовлення.',
            '2.4. Продавець має право в будь-який момент змінити опис товару, ціну товару або вилучити товар з продажу. Якщо Продавець вилучає вже сплачений товар, Продавець відшкодовує Покупцю повну суму, сплачену за вилучений та не поставлений товар.',
            '2.5. На Сайті може розміщуватись інформація щодо асортименту товару, в тому числі алкогольної продукції. Таке розміщення є інформуванням Покупця щодо асортименту та виробника товару, та не може сприйматись як реклама, тому до такої інформації не застосовують вимогу до реклами алкогольної продукції.',
        ],
    },
    {
        title: '3. Замовлення',
        paragraphs: [
            '3.1. Покупець може оформити запит на придбання і доставку товару, який є в наявності й представлений на Сайті. Оформлення здійснюється телефоном або через інтернет.',
            '3.2. Покупець може здійснити замовлення зателефонувавши за номерами телефону, зазначеними на Сайті, або залишити власний номер телефону. Покупець вказує товари та їх кількість, яку бажає замовити, самостійно перевіряє правильність вибору товарів, повідомляє інформацію щодо себе, адресу доставки, та спосіб оплати.',
            '3.3. Покупець може здійснити замовлення за допомогою «Кошика» на Сайті. Покупець вибирає товари та їх кількість, самостійно перевіряє правильність вибору товарів, заповнює інформацію щодо себе, адресу доставки та спосіб оплати.',
            '3.4. Покупець самостійно несе повну відповідальність за надання неправдивих або помилкових відомостей, що спричинило неможливість належного виконання Продавцем своїх зобов`язань перед Покупцем.',
            '3.5.Покупець підтверджує замовлення, засвідчуючи, що отримав від Продавця інформацію щодо: найменування продавця (виконавця), його місцезнаходження та порядок прийняття претензії; основні характеристики продукції; ціну, включаючи плату за доставку, та умови оплати; гарантійні зобов`язання та інші послуги, пов`язані з утриманням чи ремонтом продукції; інші умови поставки або виконання договору; період прийняття пропозицій; порядок розірвання договору.',
            '3.6. У разі зміни ціни або асортименту товару Продавець зв`язується з Покупцем через зазначені ним контакти для підтвердження замовлення з оновленою ціною або його скасування. У разі неможливості зв`язатися з Покупцем замовлення може вважатися скасованим.',
            '3.7. Продавець має право відмовитися від оформлення замовлення, якщо Покупець раніше відмовлявся від товару з причин, які не пов`язані з якістю товарів.',
            '3.8. Продавець також має право скасувати замовлення внаслідок обставин непереборної сили або у разі складнощів, пов’язаних з виконанням Договору. Продавець телефонує Покупцю за зазначеними ним контактними даними для повідомлення про скасування. Якщо Покупець оплатив замовлення, Продавець відшкодовує Покупцю повну суму, сплачену за не поставлений товар.',
        ],
    },
    {
        title: '4. Оплата',
        paragraphs: [
            '4.1. Ціна товару на Сайті вказується у гривнях.',
            '4.2. Ціна Товару не містить комісію і додаткові збори банків і платіжних систем. Покупець самостійно і своїм коштом сплачує такі збори. Розмір комісії або додаткового збору встановлює відповідний банк і платіжна система.',
            '4.3. Ціна товару діє на момент оплати й без попередження може бути змінена Продавцем в односторонньому порядку на умовах, зазначених в Договорі. Якщо ціна товару змінюється протягом обробки замовлення або ціна на Сайті не відповідає актуальній ціні, Продавець зв`язується з Покупцем через зазначені ним контакти для підтвердження замовлення з оновленою ціною або його скасування.',
            '4.4. При оплаті ціни Товару онлайн Покупець перенаправляється на вебсторінку приймання платежів Monobank, де Покупець може оплатити замовлення за допомогою карт платіжних систем Visa і Mastercard. У цьому випадку оплата регулюється правилами міжнародних платіжних систем, банків (у тому числі банком емітента картки Покупця) і інших учасників розрахунків.',
            '4.5. Продавець не здійснює обробку операцій за банківськими картками. У разі помилок або відмов в оплаті Покупець має звернутися до банку-емітента картки або до представника платіжної системи, через яку здійснювалась оплата.',
            '4.6. Будь-яка оплата, здійснена від імені Покупця з використанням персональних даних та платіжних засобів Покупця, вважається здійсненою самим Покупцем.',
        ],
    },
    {
        title: '5. Доставка',
        paragraphs: [
            '5.1. Доставка здійснюється відповідно до зони, зазначеної на Сайті.',
            '5.2. Доставка здійснюється відповідно до дати, часу і за адресою, зазначеними Покупцем при оформленні замовлення. Представник Продавця може зв`язатися з Покупцем для уточнення дати, часу й адреси, та запропонувати змінити дату й час. Якщо Продавець і Покупець не дійшли згоди про дату, час і адресу доставки, Продавець може відмовитися від виконання замовлення.',
            '5.3. Покупець зобов`язується передати кур`єру максимально точну інформацію про місцеперебування за адресою замовлення та забезпечити вільний доступ, у тому числі при наявності домофона, пристроїв контролю проходу, охорони, консьєржу тощо.',
            '5.4. При доставці товар вручається Покупцеві, або особі, яка перебуває за вказаною Покупцем адресою і яка може підтвердити відомості про замовлення та оплатити Товар, якщо він не був оплачений заздалегідь.',
            '5.5. Ризик випадкового пошкодження або зміни властивостей товару переходить до Покупця в момент отримання товару. При отриманні товару Покупець перевіряє асортимент в замовленні. Якщо виявлені розбіжності, то Покупець разом з кур`єром фіксують таку розбіжність. Покупець має право прийняти товар в частині, що відповідає замовленню.',
            '5.6. Алкогольні напої доставляються лише особам старше 18 років. Вік підтверджується документом, який може підтвердити вік Покупця і підтвердити його особистість.У разі відсутності відповідного документу, представник Продавця не передає такий товар і віднімає його вартість. У разі, якщо більшу частину замовлення складають такі напої, Продавець не передає такий товар, а Покупець оплачує (компенсує) вартість доставки.',
            '5.7. При оформленні замовлення, яке включає алкогольні напої, Покупець погоджується з тим, що має право відмовитися виключно від всього переліку замовлених алкогольних напоїв, а не їх частини.',
        ],
    },
    {
        title: '6. Повернення оплати',
        paragraphs: [
            '6.1. Покупець має право відмовитись від товару та розірвати Договір протягом 14 (чотирнадцяти) календарних днів з дати отримання товару, крім товарів, що не підлягають обміну та поверненню згідно з Постановою КМУ № 172 від 19 березня 1994 р. До товарів, що не підлягають обміну (поверненню) належать в тому числі продовольчі товари.',
            '6.2. Алкогольні напої належної якості після оплати поверненню не підлягає згідно з вимогами чинного законодавства України.',
            '6.3. Якщо Покупець виявив недоліки, він має право вимагати усунення недоліків, в тому числі за допомогою заміни товару, за умови, що недоліки виникли до передачі товару Покупцю.',
            '6.4. Порядок повернення здійснюється проводиться разом з участю оператора з приймання платежів, і регулюється правилами міжнародних платіжних систем, банків (в тому числі банком емітента карти Покупця) і інших учасників розрахунків.',
            '6.5. При односторонній відмові від Договору, передплачені кошти повертаються Покупцю тим способом, яким Покупець оплачував товар, не пізніше 30 днів з дати отримання запиту на одностороннє припинення.',
        ],
    },
    {
        title: '7. Інтелектуальна власність',
        paragraphs: [
            '7.1. Авторські права на твори, у тому числі, але не виключно, фотографії, зображення, текст, дизайн сайту в цілому і в окремих деталях, належать власнику Сайту й іншим правовласникам, за згодою яких твори розміщені на Сайті.',
            '7.2. Треті особи не мають права будь-яким чином використовувати розміщені на Сайті твори й торговельні марки, копіювати повністю або частково, поширювати, видозмінювати, відтворювати або використовувати будь-яким іншим способом без попереднього дозволу правовласника.',
            '7.3. Будь-яке використання творів та торговельних марок без дозволу правовласників є порушенням законодавства про інтелектуальну власність.',
        ],
    },
    {
        title: '8. Вирішення спорів',
        paragraphs: [
            '8.1. Якщо товар неможливо доставити, Продавець анулює замовлення і повідомляє про це Покупця. Покупець має право на узгодження нових умов замовлення, якщо такий товар пропонується до продажу.',
            '8.2. Кур`єр не є особою, уповноваженою для приймання претензій до якості, кількості або асортименту товарів на сайті. Всі претензії повинні направлятися на адресу Продавця.',
        ],
    },
    {
        title: '9. Конфіденційність',
        paragraphs: [
            '9.1. Продавець збирає та обробляє персональну інформацію, яку Покупець надає самостійно під час реєстрації або оформлення замовлення відповідно до Закону України від 01 червня 2010 № 2297-VI «Про захист персональних даних» та Договору.',
            '9.2. Персональні дані збираються та обробляються з метою надання Покупцям доступу до Сайту й обробки замовлень Покупців, інформування (у тому числі рекламними матеріалами), а також інших дій, пов`язаних з такими цілями.',
            '9.3. Політика конфіденційності та персональних даних за Договором застосовується винятково до Сайту. При переході Покупця на сайти третіх осіб (в тому числі сторонніх сервісів) Покупець керується політикою конфіденційності відповідного сервісу.',
            '9.4. Покупець вказує прізвище та ім`я, електронну пошту, номер телефону. Решта інформації надається Покупцем за його вибором в коментарі до замовлення. Покупець самостійно перевіряє достовірність наданої інформації.',
            '9.5. Продавець має право на відправлення рекламних повідомлень, просування товарів, інформаційних матеріалів щодо товарів, послуг Продавця, заходів та акцій.',
            '9.6. Продавець має право на передачу персональних даних Покупців третім особам, якщо така передача вимагається для виконання Продавцем своїх обов`язків за Договором та захисту прав та свобод Продавця або третіх осіб, якщо Покупець порушує умови Договору.',
            '9.7. Покупець має право відмовитися від отримання рекламної та іншої інформації за допомогою повідомлення на електронну пошту, вказану для контакту на Сайті.Покупець має право запросити інформацію про те, чи обробляються його дані Продавцем. Продавець надає таку відповідь протягом 30 календарних днів.',
            '9.8. Покупець має право на видалення всіх своїх персональних даних, здійснивши видалення свого аккаунта через мобільний додаток у розділі "Профіль"',
        ],
    },
];

const Privacy: FC = () => {
    return (
        <LoggedLayout>
            <AboutUsHeader />
            <section className={style.wraper}>
                {PRIVACY_TEXT.map((section, index) => (
                    <div key={index}>
                        <h1 className={style.title}>{section.title}</h1>
                        {section.paragraphs.map((text, idx) => (
                            <p key={idx} className={style.text}>
                                <b>{text}</b>
                            </p>
                        ))}
                    </div>
                ))}
            </section>
        </LoggedLayout>
    );
};

export default Privacy;
